public/roam/math/hilbert_space.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-26 Sun 14:33 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hilbert Space</title>
<meta name="generator" content="Org Mode" />
<meta name="color-scheme" content="light" />
<link rel="stylesheet" href="../../css/retro.css?v=20260426-16" />
<link rel="shortcut icon" href="https://raw.githubusercontent.com/AaronHnoraA/AaronHnoraA.github.io/refs/heads/master/css/cv.svg" type="image/x-icon">

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Hilbert Space</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6d64fe0">Hilbert Space 希尔伯特空间</a>
<ul>
<li><a href="#org84c57c5">1. 数学理解 (Mathematical Understanding)</a></li>
<li><a href="#org7f1b518">2. 量子应用 (Quantum Applications)</a></li>
</ul>
</li>
<li><a href="#orgd5796ac">有限维必完备</a></li>
<li><a href="#org9e76547">希尔伯特空间的相互作用</a></li>
</ul>
</div>
</nav>
<div class="overview" id="org9d087e8">
<ul class="org-ul">
<li><a href="#org6d64fe0">Hilbert Space 希尔伯特空间</a>
<ul class="org-ul">
<li><a href="#org84c57c5">1. 数学理解 (Mathematical Understanding)</a></li>
<li><a href="#org7f1b518">2. 量子应用 (Quantum Applications)</a></li>
</ul></li>
<li><a href="#orgd5796ac">有限维必完备</a></li>
<li><a href="#org9e76547">希尔伯特空间的相互作用</a></li>
</ul>

</div>
<div id="outline-container-org6d64fe0" class="outline-2">
<h2 id="org6d64fe0">Hilbert Space 希尔伯特空间</h2>
<div class="outline-text-2" id="text-org6d64fe0">
<div class="attention" id="orgdfe195a">
<p>
Hilbert space is a big space.
                        &ndash;&mdash; Carlton Caves
</p>

</div>
</div>
<div id="outline-container-org84c57c5" class="outline-3">
<h3 id="org84c57c5">1. 数学理解 (Mathematical Understanding)</h3>
<div class="outline-text-3" id="text-org84c57c5">
<p>
本质是将欧几里得空间 (\(\mathbb{R}^n\)) 推广到*无限维*，并保留几何直观。
</p>

<ul class="org-ul">
<li><b>核心定义</b>: 一个*完备 (Complete)* 的*内积空间 (Inner Product Space)*。
<ul class="org-ul">
<li><b>内积 (\(\langle u, v \rangle\))</b>: 定义了“角度”和“投影”。若内积为 0，则两向量正交。</li>
<li><b>范数 (\(||v||\))</b>: 由内积导出 (\(||v|| = \sqrt{\langle v, v \rangle}\))，定义了向量的“长度”。</li>
<li><b>完备性</b>: 空间内的柯西序列收敛于空间内（保证极限存在，微积分可行）。</li>
</ul></li>
<li><b>常见例子</b>:
<ul class="org-ul">
<li>\(\mathbb{R}^n\) (有限维希尔伯特空间)。</li>
<li>\(L^2\) 空间 (平方可积函数空间，量子力学中最常用)。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7f1b518" class="outline-3">
<h3 id="org7f1b518">2. 量子应用 (Quantum Applications)</h3>
<div class="outline-text-3" id="text-org7f1b518">
<p>
量子力学的公理化数学基础。
</p>

<ul class="org-ul">
<li><b>态 (State)</b>: 物理系统的状态由希尔伯特空间中的*射线*（归一化向量 \(|\psi\rangle\)）描述。</li>
<li><b>叠加原理</b>: 向量的线性组合仍然是空间中的一个有效向量。</li>
<li><b>可观测量</b>: 对应于作用在空间上的*厄米算符 (Hermitian Operators)*。
<ul class="org-ul">
<li>算符的*本征值*是测量的可能结果。</li>
<li>算符的*本征态*构成空间的基底。</li>
</ul></li>
<li><b>概率 (Born Rule)</b>: 概率幅由内积给出，概率为内积的模方 (\(P = |\langle \phi | \psi \rangle|^2\))。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd5796ac" class="outline-2">
<h2 id="orgd5796ac">有限维必完备</h2>
<div class="outline-text-2" id="text-orgd5796ac">
<div class="theorem" id="orgd1200b7">
<p>
在有限维内积空间中，所有柯西序列均收敛于该空间内的某个向量。因此，有限维内积空间()天然是完备的，即有限维内积空间即为希尔伯特空间。
</p>

</div>

<div class="proof" id="org993b54e">
<ul class="org-ul">
<li>证明思路</li>
</ul>


<ul class="org-ul">
<li>选取正交基</li>
<li>将向量柯西列转化为坐标柯西列</li>
<li>利用实数/复数的完备性</li>
<li>再拼回向量极限</li>

<li>证明</li>
</ul>

<p>
设 \(V\) 是 \(N\) 维复内积空间。
</p>

<p>
** Step 1：选取正交基
</p>

<p>
由 Gram–Schmidt 正交化，存在正交基：
\[
    \{e_1,e_2,\dots,e_N\}
    \]
</p>

<p>
** Step 2：设 \(\{v_i\}\) 为柯西列
</p>

<p>
对任意 \(\varepsilon>0\)，存在 \(n\)，
使得当 \(i,j>n\) 时：
\[
    d(v_i,v_j)<\varepsilon
    \]
</p>

<p>
** Step 3：写成坐标形式
</p>

<p>
对每个 \(i\)，存在唯一的 \(z_{ik}\in\mathbb C\)，
使得：
\[
    v_i=\sum_{k=1}^N z_{ik}e_k
    \]
</p>


<p>
** Step 4：距离的坐标表达
</p>

<p>
由正交性：
\[
    d(v_i,v_j)^2
    =\sum_{k=1}^N |z_{ik}-z_{jk}|^2
    <\varepsilon^2
    \]
</p>

<p>
** Step 5：拆分为实部与虚部
</p>

<p>
记：
\[
    z_{ik}=x_{ik}+iy_{ik}
    \]
</p>

<p>
则：
\[\sum_{k=1}^N |x_{ik}-x_{jk}|^2
    +\sum_{k=1}^N |y_{ik}-y_{jk}|^2
    < \varepsilon^2\]
</p>

<p>
** Step 6：坐标收敛
</p>

<p>
对每个 \(k\)，
\(\{x_{ik}\}_i,\{y_{ik}\}_i\) 为实数柯西列。
</p>

<p>
由 \(\mathbb R\) 的完备性，
存在 \(x_k,y_k\in\mathbb R\)，
使得：
\[
    x_{ik}\to x_k,\quad y_{ik}\to y_{k}
    \]
</p>

<p>
** Step 7：构造极限向量
</p>

<p>
令：
\[
    z_k=x_k+iy_k,\quad
    v=\sum_{k=1}^N z_k e_k
    \]
</p>

<p>
则：
\[
    d(v_i,v)\to 0
    \]
</p>

<p>
故：
\[
    v_i\to v
    \]
</p>

<ul class="org-ul">
<li>结论</li>
</ul>

<p>
有限维内积空间是完备的。
</p>

</div>
</div>
</div>
<div id="outline-container-org9e76547" class="outline-2">
<h2 id="org9e76547">希尔伯特空间的相互作用</h2>
<div class="outline-text-2" id="text-org9e76547">
<div class="theorem" id="org1b8472e">
<p>
希尔伯特空间的相互作用
给定任意两个（或更多）希尔伯特空间，利用直和或张量积的方式，可以给出一个更大的希尔伯特空间。
</p>

</div>
<p>
这意味着 这为量子力学中张量积干涉两个量子系统提供了理论支撑.
</p>
</div>
</div>
</div>
</body>
</html>
